go-go-golems/esp32-s3-m5/0110-papers3-epd-density-step-response/sdkconfig.defaults
# PaperS3 / ESP32-S3
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# PaperS3 octal PSRAM is required for packed physical/target buffers.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288
CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING=y

# EPD_Painter expresses 4 ms and 8 ms waveform gaps through FreeRTOS delays.
# A 1000 Hz tick preserves those durations; the ESP-IDF 100 Hz default would
# truncate pdMS_TO_TICKS(4/8) to zero.
CONFIG_FREERTOS_HZ=1000

# Interactive control is exclusively on native USB Serial/JTAG.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
# CONFIG_ESP_CONSOLE_UART is not set
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Stable evidence logs.
CONFIG_LOG_COLORS=n
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
